var survey1 = {
    "title": "测一测你的亲密关系",
    "introduce": "在亲密关系中，每个人都有自己的依恋类型，它从我们婴儿时与父母的相处中发展而出，影响着我们在爱情中的行为和表现。在恋爱中，你属于那种依恋类型呢？",
    "notice": "请根据你的一般体验，选择自己认为较为合适的选项",
    "lists": [{
        question: '无论我的心情多么低落，我都不喜欢向恋人表露。',
        id: 1,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']
    }, {
        question: '我担心会被抛弃。',
        id: 2,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']
    }, {
        question: '和恋人亲密相处，我感到非常舒服。',
        id: 3,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']
    }, {
        question: '我很担心我的人际交往状况。',
        id: 4,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '正当恋人开始亲近我时，我感到我不由自主地想逃避。',
        id: 5,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我担心恋人不会像我在乎他（她）那样在乎我。',
        id: 6,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '当恋人很想亲近我时，我会感到不舒服。',
        id: 7,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我非常担心失去我的恋人。',
        id: 8,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '当我对恋人敞开心扉时，我感到不舒服。',
        id: 9,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我常常希望恋人对我的感情和我对他（她）的感情一样强烈。',
        id: 10,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我想亲近我的恋人，但是我又总是退缩。',
        id: 11,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我经常有想要于恋人融为一体的感觉，但这常常会把他（她）吓跑。',
        id: 12,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '当恋人与我太亲近时，我会紧张。',
        id: 13,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我害怕一个人独处。',
        id: 14,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '和恋人分享我的个人感受和想法时，我感到很舒服。',
        id: 15,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我想与人亲近的强烈欲望有时会把人们给吓跑。',
        id: 16,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我尽量避免于恋人太过亲近。',
        id: 17,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我需要大量被恋人所爱的保证，这样我才感到安心。',
        id: 18,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我感到与恋人亲近是比较容易的。',
        id: 19,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我感到有时会强迫恋人对我表示出更多的情感和责任。',
        id: 20,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我感到要让我依赖恋人是很困难的。',
        id: 21,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我并不担心会被抛弃。',
        id: 22,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我不喜欢和恋人太过于亲近。',
        id: 23,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '如果我不能使恋人对我感兴趣，我就会感到不安或生气。',
        id: 24,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我与恋人无所不说。',
        id: 25,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我感到恋人不像我要亲近他（她）那样的来亲近我。',
        id: 26,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我通常和我的恋人探讨我的问题和担忧。',
        id: 27,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '当我不与他人交往时，我就会感到有点焦虑和不安全。',
        id: 28,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我感觉依赖恋人很舒服。',
        id: 29,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '当恋人不像我想的那样在我的身边时，我感到很受挫。',
        id: 30,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我不介意向恋人寻求安慰、建议和帮助。',
        id: 31,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '如果我需要恋人但他（她）却不在我身边时，我感到很受挫。',
        id: 32,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '在我有需要的时候向恋人求助是很有用的。',
        id: 33,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '当恋人不赞同我时，我感觉自己糟糕透了。',
        id: 34,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '我会因为许多事向恋人寻求帮助，包括安慰和宽心。',
        id: 35,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }, {
        question: '当恋人有一段时间不在我身边度过时，我会感到很愤怒。',
        id: 36,
        choose: ['非常不赞成', '比较不赞成', '有点不赞成', '不确定', '有点赞成', '比较赞成', '非常赞成']

    }],

};
var survey2 = {
    "title": "你是一个追求完美的人吗",
    "introduce": "完美是人们渴望得到并追求的一种理念和动力，其实我们每个人，或多或少都对完美有一定的追求。适度的追求可以让我们做事更有动力、更加精益求轻，但过度的完美主义会让我们出现内心焦急、烦躁等症状，这不仅会降低我们做事的效率，更有甚者，还会对我们的我们的日常生活、工作和人际交往产生不良影响。",
    "notice": "请根据你的实际情况，选择最适合的选项",
    "lists": [{
        question: "我的父母曾给我定下很高的标准。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "做事有条理有系统对我是十分重要的。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "如果我不给自己定下最高的标准，我很可能沦落为次等的人。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我是个整洁的人。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我尽量做一个有条理的人。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "如果我在工作或学习中失败，这说明我整个是很失败的人。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我的父母曾希望我在各方面都是最出色的。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "比起大多数人，我定下更高的目标。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "若有人工作或学习比我强，我会觉得自己整个地就失败了。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "做事或学习的时候若是有部分的失败，我会觉得自己完全失败了。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "尽管我小心翼翼地做事情，还是经常感到自己做的不太正确。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我厌恶做事不能做的最佳。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我有极高的目标。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我的父母曾经期望我做的特别出色。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "假如我犯错误，人们很可能会轻看我。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "如果我不能做的跟别人一样好，说明我是个低人一等的人。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "比起我，别人似乎比我更能接受低一些的标准。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "如果我不能始终表现的出色，我就会失去别人对我的尊敬。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "比起我，父母对我的未来经常有很高的期望。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我尽力成为一个整洁的人。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我经常对一些日常小事犹豫不决。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "整洁对我来说是十分重要的。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "比起大多数人，我要求自己在每天的工作中有更好的成绩。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我是一个有条理的人。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我的工作进度缓慢，因为我常重复那些工作。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "为了把一件事情做好，我需要花较长的时间。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }, {
        question: "我从不觉得自己能够达到我父亲为我定下的标准。",
        choose: ["不符合", "有点不符合", "不能确定", "有点符合", "符合"]
    }]
};
var survey3 = {
    "title": "测测你的强迫指数",
    "introduce": "强迫分为思维上的强迫和行为上的强迫。绝大多数人在生命的某些时刻，都会出现一些强迫性思维或行为，但这并不等于强迫症。作为焦虑障碍的一种，强迫症的典型特点是有意识的强迫与反强迫并存，一些毫无意义、甚至违背自己意愿的想法或冲动反反复复侵入患者的日常生活。",
    "notice": "请根据你过去一个月的经历，选择合适的选项",
    "lists": [{
        question: "是否有令你不快的想法或图像反复进入你的脑海，如：与污染有关（污物、细菌、化学物品、放射性物质），或者担心自己得了严重的疾病，例如艾滋病？",
        choose: ["是的", "没有"]
    }, {
        question: "是否有令你不快的想法或图像反复进入你的脑海，如：过度关注于要把物品（衣物、工具等）排列整齐或者放在特定位置上？",
        choose: ["是的", "没有"]
    }, {
        question: "是否有令你不快的想法或图像反复进入你的脑海，如：死亡或者其他恐惧事件的画面？",
        choose: ["是的", "没有"]
    }, {
        question: "是否有令你不快的想法或图像反复进入你的脑海，如：个人不能接受的关于宗教或性方面的想法？",
        choose: ["是的", "没有"]
    }, {
        question: "是否很担心会发生可怕的事情，例如：房子遭受了火灾、盗窃或者洪水？",
        choose: ["是的", "没有"]
    }, {
        question: "是否很担心会发生可怕的事情，例如：开车时意外撞到行人或者滚下山坡?",
        choose: ["是的", "没有"]
    }, {
        question: "是否很担心会发生可怕的事情，例如：传播疾病（例如，将艾滋病传染给某人）？",
        choose: ["是的", "没有"]
    }, {
        question: "是否很担心会发生可怕的事情，例如：失去珍贵的东西？",
        choose: ["是的", "没有"]
    }, {
        question: "是否很担心会发生可怕的事情，例如：由于你不够细心，导致心爱的人受伤？",
        choose: ["是的", "没有"]
    }, {
        question: "是否担心将自己不想要的、无意义的本能或冲动付诸行动，例如：伤害心爱的人的身体，将陌生人推到公交车前，开车撞向迎面而来的车辆，不恰当的性接触，或者给食客下毒？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：过度或仪式化的清洗、打扫或打扮？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：检查电灯开关、水龙头、炉子、门锁或者紧急刹车？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：计数、排列；夜里起床（确保袜子在同一高度）?",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：收集没用的物品或丢垃圾前检查垃圾？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：重复一定次数的例行动作（坐下 / 起身、穿过门道、重复点烟），或者重复该动作直到感觉正好？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：需要触摸物品或者人？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：不必要的重复阅读或重复书写；寄出信件前将信封再次打开？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：检查身体的疾病迹象？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：回避与可怕的事件或令人不悦的想法有关的颜色（“红色”意味着血 ）、数字（“13”不吉利）或名字（与 4 谐音的表示死亡）？",
        choose: ["是的", "没有"]
    }, {
        question: "你是否感到自己被迫一遍又一遍地去做某些事，如：需要“承认”或反复询问来确认你说过的话或做过的事是正确的？",
        choose: ["是的", "没有"]
    }, {
        question: "一般来说，这些想法或行为每天占据你多少时间？",
        choose: ["没有", "少于1小时", "1~3小时", "3~8小时", "超过8小时"]
    }, {
        question: "它们给你带来多大的痛苦？",
        choose: ["没有", "轻微", "中度", "严重", "极重"]
    }, {
        question: "控制它们对你而言有多困难？",
        choose: ["可以完全控制", "基本可控", "中度可控", "很难控制", "完全失控"]
    }, {
        question: "它们在多大程度上导致你回避做某事、去某地、或和人相处？",
        choose: ["没有", "偶尔回避", "有时回避", "经常回避", "完全回避"]
    }, {
        question: "在多大程度上干扰到你的学习、工作、社交、 家庭生活？",
        choose: ["无干扰", "轻微干扰", "中度干扰", "重度干扰", "极重干扰"]
    }]
}

var survey4 = {
    "title": "你是一个追求完美的人吗",
    "introduce": "完美是人们渴望得到并追求的一种理念和动力，其实我们每个人，或多或少都对完美有一定的追求。适度的追求可以让我们做事更有动力、更加精益求轻，但过度的完美主义会让我们出现内心焦急、烦躁等症状，这不仅会降低我们做事的效率，更有甚者，还会对我们的我们的日常生活、工作和人际交往产生不良影响。",
    "notice": "",
    "lists": [{
        question: "你打开了刚买的一件设备，插上电，却发现它根本就不工作。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你被一名修理人员敲诈，他要挟你。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你和其他人都犯了错误，可别人侥幸逃过，上司单单把你拎出来批评。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你的车陷进了泥潭或者雪窝里。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你正在和某人说话，而对方却不理睬你。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "有人谎称他们有某种东西，而事实上他们却没有。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "在咖啡店，你正费力的把四杯咖啡往自己的桌子前端时，有人撞到了你，咖啡溅了出来。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你已经把衣服挂好了，但是却有人把它们碰到了地上，而且没有把它们捡起来。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "从你进商店的那一刻起，售货员就一直缠着向你推销某个产品。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你已经约好和某人一起去某地，但是这人却在最后一刻爽约了，把你一个人晾在那里。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "被人开玩笑或被人奚落。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "红灯了，你的车停下来，而后面的家伙却不停的冲你按喇叭。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你在停车场不小心转错了弯儿，刚一下车，就有人朝你吼：”你到底会不会开车？”",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "有人犯了错，却拿这件错事责备你。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你正想集中精力，但是你周围的人却在用脚打拍子。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你把某本重要的书或某个重要的工具借给某人，他们却不还给你。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你忙了一整天，但是和你在一起住的人却开始埋怨你，说你把答应Ta的事给忘了。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你想和你的同伴或同事讨论某个重要的事情，但是他却不给你机会表达你的感受。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "有个人对某个问题本来知之甚少，可Ta还要固执地和你争论个没完。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "当你和某个人进行讨论时，另外一个人却坚持要进来插话。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你需要赶快到某个地方去，但是你面前的汽车却在60公里∕小时的区域里以40公里∕小时的速度往前开，而且你还不能超车。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "踩到一块嚼过的口香糖上。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "经过一小群人身边时，听到他们在嘲笑你。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "匆匆忙忙要去某个地方，结果你的一条很好的裤子／裙子被一个锋利的东西划破了。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }, {
        question: "你用身上的最后一枚硬币打电话，可是还没拨完后就断线了，而硬币也没有了。",
        choose: ["几乎不生气 ", "有一点点生气", "有些生气", "相当生气", "极为愤怒 "]
    }]
};

//var lists=survey1.lists;

// var lists = [{
//     question: '',
//     choose: ['完全没有', '几天', '一半以上的天数', '', 'dstg']
// a: '完全没有',
// b: '几天',
// c: '一半以上的天数',
// d: '几乎每天',
// e: 'hjj',
//     // f: 'gvfjsidko '
// }, {
//     question: '总是担心某件事，停止不下来',
//     length: 4,
//     choose: ['完全没有', '几天', '一半以上的天数', '几乎每天', ]


// }, {
//     question: '对所有的事情都感到非常担心',
//     choose: ['完全没有', '几天', '一半以上的天数', '几乎每天']
// }, {
//     question: '觉得很紧张，很难放松下来',
//     choose: ['完全没有', '几天', '一半以上的天数', '几乎每天']

// }, {
//     question: '感觉非常烦躁，坐立难安',
//     choose: ['完全没有', '几天', '一半以上的天数', '几乎每天']

// }];




var survey = new Vue({
    el: ".con",
    data: {
        message: [],
        notice: survey2.notice,
        lists: survey2.lists,
        title: survey2.title,
        introduce: survey2.introduce,
        cover: '',
        result: [],

    },
    methods: {
        skip: function () {
            var this_active = mySwiper.activeIndex;
            setTimeout(function () {
                mySwiper.slideTo(this_active + 1, 700);
            }, 500);
        },

        getResult: function () {
            console.log($(this).attr('type'));
        },
    },
    mounted: function () {
        var mySwiper = new Swiper('.swiper-container', {
            pagination: { //分页  
                el: '.swiper-pagination', //添加分页  
                type: 'progressbar', //进度条指示器   

            },
            navigation: { //上一题
                nextEl: '.swiper-button-next',
                prevEl: '.pre',
            },
            on: {
                init: function (swiper) { //Swiper初始化
                    var total = document.querySelectorAll('.swiper-slide').length;
                    $(".swiper-num .active").text(1);
                    $(".swiper-num .total").text(total);
                },
                slideChange: function () {
                    var active = mySwiper.activeIndex;
                    $(".swiper-num .active").text(active + 1);
                    var total = document.querySelectorAll('.swiper-slide').length;
                    $(".swiper-num .total").text(total);
                },
                slidesPerView: 1,
                paginationClickable: true,
                spaceBetween: 30,
                loop: false,
                onReachEnd: function (swiper) {
                    $("#t2").hide();
                    $("#t3").show();
                }
            }
        });

    }
});


// swiper
var mySwiper = new Swiper('.swiper-container', {
    pagination: { //分页  
        el: '.swiper-pagination', //添加分页  
        type: 'progressbar', //进度条指示器   

    },
    navigation: { //上一题
        nextEl: '.swiper-button-next',
        prevEl: '.pre',
    },
    on: {
        init: function (swiper) { //Swiper初始化
            var total = document.querySelectorAll('.swiper-slide').length;
            $(".swiper-num .active").text(1);
            $(".swiper-num .total").text(total);
        },
        slideChange: function () {
            var active = mySwiper.activeIndex;
            $(".swiper-num .active").text(active + 1);
            var total = document.querySelectorAll('.swiper-slide').length;
            $(".swiper-num .total").text(total);

            // var chooseLength = survey.lists[i].length;
            // console.log(chooseLength);
            // for (var j = 0; j < survey.lists[i].length ; i++) {
            //     if (survey.lists[i](['a', 'b', 'c', 'd', 'e', 'f'])[j])
            // }
            // $('.choose>div:nth-of-type(n+' + (survey.lists[i].length - 1 )+ ')').hide()
        },
        slidesPerView: 1,
        paginationClickable: true,
        spaceBetween: 30,
        loop: false,
        onReachEnd: function (swiper) {
            $("#t2").hide();
            $("#t3").show();
        }
    }
});


$("#t2,#t3").hide();
$(".startSurvey").on("click", function () {
    $("#t1").hide();
    $("#t2").show();
});
$(".end").hide();
$(".input").on("click", function () {
    if (mySwiper.isEnd) {
        $(".end").show();
    }
});
$(".last .input").on("click", function () {
    $(".end").show();
});
$('.end').click(function () {
    if (mySwiper.isEnd) {
        $("#t2").hide();
        $("#t3").show();
    }
});
$(".back").on("click", function () {
    history.back(-1);
});
// 获取测试选项
// var radio=new Array();
// var i=0;
// radio[i]=$('input:radio:checked').val();
// console.log(radio);
// console.log($('input:radio:checked').val());
// var total = document.querySelectorAll('.swiper-slide').length;
// var results = [];
// for (i = 1; i <= total; i++) {
//     var a = $('input:checked').value;
//     console.log(a)
// };
// var a = $('input:checked').value;
// $("input").click(function () {
//     console.log($('input:checked').attr('type'))
// });
var results = [];
var i = mySwiper.activeIndex;
$(".input").click(function () {
    $(this).siblings().find(".circle").removeClass("sel");
    $(this).find(".circle").addClass("sel");
    var value = $(this).find("input").attr("value");
    var i = mySwiper.activeIndex;
    results[i] = value;
    console.log(results);
});